In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
df = pd.read_csv("scout_car_My_solucon 1.Jupyter.csv")

In [3]:
df.head(2)

,Unnamed: 0,make_model,short_description,body_type,price,vat,km,registration,prev_owner,hp,...,Safety & Security,description,Emission Label,Gears,Country version,Now,age_car,Consumption_comb,Consumption_city,Consumption_country
0,0,Audi A1,Sportback 1.4 TDI S-tronic Xenon Navi Klima,Sedans,15770,VAT deductible,56013.0,01/2016,2.0,66,...,"['ABS', 'Central door lock', 'Daytime running ...","['\n', 'Sicherheit:', ' ', 'Deaktivierung für ...",NaN,NaN,NaN,2020,4.0,3.8,4.3,3.5
1,1,Audi A1,1.8 TFSI sport,Sedans,14500,Price negotiable,80000.0,03/2017,NaN,66,...,"['ABS', 'Central door lock', 'Central door loc...",['\nLangstreckenfahrzeug daher die hohe Kilome...,Green,7.0,NaN,2020,3.0,5.6,7.1,4.7

# Missingler le mücadele

In [4]:
df.iloc[:,[1]]

           make_model
0             Audi A1
1             Audi A1
2             Audi A1
3             Audi A1
4             Audi A1
...               ...
15914  Renault Espace
15915  Renault Espace
15916  Renault Espace
15917  Renault Espace
15918  Renault Espace

[15919 rows x 1 columns]

In [5]:
df["make_model"].value_counts(dropna=True)

Audi A3           3097
Audi A1           2614
Opel Insignia     2598
Opel Astra        2526
Opel Corsa        2219
Renault Clio      1839
Renault Espace     991
Renault Duster      34
Audi A2              1
Name: make_model, dtype: int64

In [6]:
df["make_model"].isnull().sum()

0

### df["short_description"] Aracın genel  özellikleriyle karsılastır

In [7]:
df.iloc[:,[2]]

                                       short_description
0            Sportback 1.4 TDI S-tronic Xenon Navi Klima
1                                         1.8 TFSI sport
2      Sportback 1.6 TDI S tronic Einparkhilfe plus+m...
3                                1.4 TDi Design S tronic
4      Sportback 1.4 TDI S-Tronic S-Line Ext. admired...
...                                                  ...
15914              Blue dCi 200CV EDC Executive 4Control
15915                TCe 225 EDC GPF LIM Deluxe Pano,RFK
15916  Blue dCi 200 EDC Initiale Paris Leder LED Navi...
15917  Blue dCi 200CV EDC Business , NUOVA DA IMMATRI...
15918        INITIALE PARIS TCe 225 EDC GPF NAVI SHZ AUX

[15919 rows x 1 columns]

In [8]:
df["short_description"]

0              Sportback 1.4 TDI S-tronic Xenon Navi Klima
1                                           1.8 TFSI sport
2        Sportback 1.6 TDI S tronic Einparkhilfe plus+m...
3                                  1.4 TDi Design S tronic
4        Sportback 1.4 TDI S-Tronic S-Line Ext. admired...
                               ...
15914                Blue dCi 200CV EDC Executive 4Control
15915                  TCe 225 EDC GPF LIM Deluxe Pano,RFK
15916    Blue dCi 200 EDC Initiale Paris Leder LED Navi...
15917    Blue dCi 200CV EDC Business , NUOVA DA IMMATRI...
15918          INITIALE PARIS TCe 225 EDC GPF NAVI SHZ AUX
Name: short_description, Length: 15919, dtype: object

### df["body_type"]

In [9]:
df.iloc[:,[3]]

      body_type
0        Sedans
1        Sedans
2        Sedans
3        Sedans
4        Sedans
...         ...
15914       Van
15915       Van
15916       Van
15917       Van
15918       Van

[15919 rows x 1 columns]

In [10]:
df["body_type"].value_counts(dropna = False)

Sedans           7903
Station wagon    3553
Compact          3153
Van               783
Other             290
Transporter        88
NaN                60
Off-Road           56
Coupe              25
Convertible         8
Name: body_type, dtype: int64

In [11]:
df["body_type"].isnull().sum()

60

In [12]:
df[df["body_type"].isnull()]["body_type"][0:2]# Nan ların indexi

3175    NaN
3255    NaN
Name: body_type, dtype: object

In [13]:
"""body_typ_nan = df[(df["make_model"] == "Audi A3") & (df["body_type"].isnull())]["body_type"]
body_typ_nan """

'body_typ_nan = df[(df["make_model"] == "Audi A3") & (df["body_type"].isnull())]["body_type"]\nbody_typ_nan '

In [14]:
"""body_typ_nan = df[(df["make_model"] == "Audi A3") & (df["body_type"].isnull())]["body_type"]
body_typ_nan.fillna("deneme", inplace = True)"""

'body_typ_nan = df[(df["make_model"] == "Audi A3") & (df["body_type"].isnull())]["body_type"]\nbody_typ_nan.fillna("deneme", inplace = True)'

## calısmadı ama neden????????? 

i_1 = 0
body_non_make_modeller = df[df["body_type"].isnull()]["make_model"]
for i in body_non_make_modeller:
    
    if i_1 != i :
        print(i)
        mode = df[df["make_model"] == f"{i}"]["body_type"].mode()[0]
        print(mode)
        
         
        body_typ_nan = df[(df["make_model"] == f"{i}") & (df["body_type"].isnull())]["body_type"]
        print(body_typ_nan)
        
        print("************") 
        body_typ_nan.fillna(mode, inplace = True)
        print(body_typ_nan)
           
                       
     
    i_1 = i

In [15]:
i_1 = 0
body_non_make_modeller = df[df["body_type"].isnull()]["make_model"]
for i in body_non_make_modeller:
    
    if i_1 != i :
        
               
        mode = df[df["make_model"] == f"{i}"]["body_type"].mode()[0]
         
        body_typ_nan = df[(df["make_model"] == f"{i}") & (df["body_type"].isnull())]["body_type"]
        
        #print(mode)
        print("************", i, mode)  
        
        for index in body_typ_nan.index :
            
            
            df.loc[index, "body_type"] = mode
            print(df.loc[index, "body_type"])
            
     
    i_1 = i

************ Audi A3 Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
************ Opel Astra Station wagon
Station wagon
Station wagon
Station wagon
Station wagon
Station wagon
Station wagon
Station wagon
************ Opel Corsa Compact
Compact
Compact
************ Opel Insignia Station wagon
Station wagon
Station wagon
Station wagon
************ Renault Clio Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
Sedans
************ Renault Espace Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van
Van

In [16]:
df["body_type"].isnull().sum()

0

In [17]:
df["body_type"].value_counts(dropna=False)

Sedans           7925
Station wagon    3563
Compact          3155
Van               809
Other             290
Transporter        88
Off-Road           56
Coupe              25
Convertible         8
Name: body_type, dtype: int64

## Drop

In [18]:
df.drop("Body", axis =1, inplace=True)

In [19]:
df.columns

Index(['Unnamed: 0', 'make_model', 'short_description', 'body_type', 'price',
       'vat', 'km', 'registration', 'prev_owner', 'hp', 'Previous Owners',
       'Next Inspection', 'Warranty', 'Full Service', 'Non-smoking Vehicle',
       'Make', 'Model', 'First Registration', 'Body Color', 'Paint Type',
       'Body Color Original', 'Upholstery', 'Nr. of Doors', 'Nr. of Seats',
       'Model Code', 'Gearing Type', 'Displacement', 'Cylinders', 'Weight',
       'Drive chain', 'Fuel', 'CO2 Emission', 'Emission Class',
       'Comfort & Convenience', 'Entertainment & Media', 'Extras',
       'Safety & Security', 'description', 'Emission Label', 'Gears',
       'Country version', 'Now', 'age_car', 'Consumption_comb',
       'Consumption_city', 'Consumption_country'],
      dtype='object')

## df['vat']

In [28]:
#### df['vat']   vat deductive ise True degil se False

In [40]:
df['vat'].value_counts(dropna =False)

True                10980
NaN                  4513
Price negotiable      426
Name: vat, dtype: int64

In [34]:
df['vat'].isnull().sum() / df['vat'].shape[0]*100

28.349770714240847

In [39]:
df['vat'].replace("VAT deductible", True, inplace =True)

In [41]:
df['vat'].replace("Price negotiable", False, inplace =True)

In [43]:
df["vat"].fillna(True, inplace = True)

In [47]:
df['vat'].isnull().sum()

0

### df["km"]

In [53]:
df.columns[6]

'km'

In [55]:
df["km"].isnull().sum()

1024

In [56]:
df["km"].isnull().sum() / df.km.shape[0]*100

6.432564859601733

In [60]:
df.columns

Index(['Unnamed: 0', 'make_model', 'short_description', 'body_type', 'price',
       'vat', 'km', 'registration', 'prev_owner', 'hp', 'Previous Owners',
       'Next Inspection', 'Warranty', 'Full Service', 'Non-smoking Vehicle',
       'Make', 'Model', 'First Registration', 'Body Color', 'Paint Type',
       'Body Color Original', 'Upholstery', 'Nr. of Doors', 'Nr. of Seats',
       'Model Code', 'Gearing Type', 'Displacement', 'Cylinders', 'Weight',
       'Drive chain', 'Fuel', 'CO2 Emission', 'Emission Class',
       'Comfort & Convenience', 'Entertainment & Media', 'Extras',
       'Safety & Security', 'description', 'Emission Label', 'Gears',
       'Country version', 'Now', 'age_car', 'Consumption_comb',
       'Consumption_city', 'Consumption_country'],
      dtype='object')

In [66]:
df.groupby(["make_model", "age_car"])["km"].mean()

make_model      age_car
Audi A1         1.0         2494.501053
                2.0        13785.852901
                3.0        25821.712963
                4.0        54332.286169
Audi A2         2.0        26166.000000
Audi A3         1.0         2126.757322
                2.0        18410.524485
                3.0        43853.140741
                4.0        90092.982885
Opel Astra      1.0         2915.672018
                2.0        21442.708738
                3.0        49981.778535
                4.0        89134.265896
Opel Corsa      1.0         1079.616514
                2.0        17426.714495
                3.0        39977.979058
                4.0        62904.030303
Opel Insignia   1.0         3483.250000
                2.0        22193.801567
                3.0        47732.103565
                4.0        93187.985891
Renault Clio    1.0          727.282946
                2.0        15396.517730
                3.0        36660.153318
                4.0        68564.279126
Renault Duster  1.0          101.000000
Renault Espace  1.0         1755.752525
                2.0        14203.599138
                3.0        41886.635294
                4.0        74400.566667
Name: km, dtype: float64

In [ ]:
df.groupby(["make_model", "age_car"])["km"].mean()

*****km Nan larının 838 tanesi nin yas degeri de bos. % 81 bos

In [78]:
df[df.km.isnull()][["make_model", "age_car"]].isnull().sum() / df[df.km.isnull()][["make_model", "age_car"]].shape[0] *100

make_model     0.000000
age_car       81.835938
dtype: float64

In [79]:
df[df.km.isnull()][["make_model", "age_car"]].isnull().sum()

make_model      0
age_car       838
dtype: int64

### yasın yüzde 10 bos

In [87]:
df["age_car"].isnull().sum() / df["age_car"].shape[0] * 100

10.032037188265594

In [100]:
df[df["km"].notna()]["age_car"].isnull().sum()/ df[df["km"].notna()]["age_car"].shape[0] * 100

5.095669687814703

In [111]:
df[df["km"].isnull()].groupby(["make_model", "age_car"])["make_model", "age_car"].mean()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                        age_car
make_model     age_car
Audi A1        1.0          1.0
               2.0          2.0
Audi A3        1.0          1.0
               2.0          2.0
Opel Astra     1.0          1.0
               2.0          2.0
Opel Corsa     1.0          1.0
Opel Insignia  1.0          1.0
               2.0          2.0
Renault Clio   1.0          1.0
               2.0          2.0
               3.0          3.0
Renault Espace 1.0          1.0
               2.0          2.0

In [120]:
df.groupby("make_model")[["km","make_model","age_car"]].mean()

                          km   age_car
make_model
Audi A1         23925.285173  2.527535
Audi A2         26166.000000  2.000000
Audi A3         40340.800000  2.642524
Opel Astra      39023.504641  2.512024
Opel Corsa      25616.984630  2.325254
Opel Insignia   42011.823230  2.629133
Renault Clio    30489.935853  2.565598
Renault Duster    101.000000  1.000000
Renault Espace  35152.019108  2.610811

In [122]:
df["age_car"].value_counts()

2.0    4522
4.0    3674
3.0    3273
1.0    2853
Name: age_car, dtype: int64

In [ ]:
df["age_car"

In [25]:
df["Next Inspection"].unique()

array(["['\\n06/2021\\n', '\\n99 g CO2/km (comb)\\n']", nan,
       "['\\n02/2020\\n', '\\n97 g CO2/km (comb)\\n']", ...,
       "['\\n02/2022\\n', '\\n153 g CO2/km (comb)\\n']",
       "['\\n06/2021\\n', '\\n', '7.4 l/100 km (comb)', '\\n', '9.2 l/100 km (city)', '\\n', '6.3 l/100 km (country)', '\\n']",
       "['\\n01/2022\\n', '\\n168 g CO2/km (comb)\\n']"], dtype=object)

k=["".join(item).strip() if type(item) == list else item for item in oto["Next Inspection"]]


Joseph - Instructor  8:10 PM
nxtins = ["".join(item).strip() if type(item) == list else item for item in oto["Next Inspection"]]